# Importing Libraries

In [35]:
import pandas as pd

In [36]:
df = pd.read_csv("cleaned_datafile.csv")

In [37]:
df.head()

,State-Code,Name,TRU,Age-Group,Tot-P,Tot-M,Tot-F,Persons-exactly-1,Males-exactly-1,Females-exactly-1,Persons-exactly-2,Males-exactly-2,Females-exactly-2,Persons-atleast-3,Males-atleast-3,Females-atleast-3
0,0,INDIA,Rural,5-9,93807612,48825259,44982353,84515361,44009879,40505482,8619753,4459004,4160749,672498,356376,316122
1,0,INDIA,Rural,10-14,96804494,50488158,46316336,75843895,39482164,36361731,17321726,9076421,8245305,3638873,1929573,1709300
2,0,INDIA,Rural,15-19,83902472,44570557,39331915,59354806,31228261,28126545,17987978,9726204,8261774,6559688,3616092,2943596
3,0,INDIA,Rural,20-24,73835046,38138662,35696384,51929482,25958518,25970964,15939543,8730193,7209350,5966021,3449951,2516070
4,0,INDIA,Rural,25-29,66068270,33375989,32692281,48015316,23114804,24900512,13483541,7492507,5991034,4569413,2768678,1800735

# Dropping irrelevant rows and columns

In [38]:
df = df[(df['TRU']=='Total') & (df['Age-Group']=='Total')]
cols = ['State-Code','Persons-exactly-1','Persons-exactly-2','Persons-atleast-3']
df = df[cols]

In [39]:
df.head()

     State-Code  Persons-exactly-1  Persons-exactly-2  Persons-atleast-3
18            0          895866207          228979190           86009580
48            1            6358112            4086970            2096220
78            2            5621897             895419             347286
108           3           14708114            5205311            7829913
138           4             475530             257941             321979

# Finding required ratios

In [40]:
df2 = pd.DataFrame(columns=['state-code','2-to-1-ratio'])
df2[['state-code']] = df[['State-Code']]
df2['2-to-1-ratio'] = (df['Persons-exactly-2']/df['Persons-exactly-1'])

In [41]:
df2.head()

     state-code  2-to-1-ratio
18            0      0.255595
48            1      0.642796
78            2      0.159273
108           3      0.353907
138           4      0.542428

In [42]:
df2_top2 = df2.sort_values('2-to-1-ratio',ascending=False).head(3)
df2_worst2 = df2.sort_values('2-to-1-ratio').head(3)

In [43]:
result2 = df2_top2.append(df2_worst2)[['state-code','2-to-1-ratio']]

In [44]:
result2

      state-code  2-to-1-ratio
1068          35      1.499862
918           30      1.157976
378           12      0.938953
258            8      0.105877
288            9      0.114661
678           22      0.133643

In [45]:
result2.to_csv("2-to-1-ratio.csv",index = False)